
public class Ex210506 {

	public static void main(String[] args) {
		// 하루정리
		// 리터널 : 자연어
		/*       정수 : 10, 1, 2, 3....
		 *       실수 : 0.5 ...
		 *       문자 : '1', '10'(x)
		 *       문자열 : "1", "10"...
		 */

		// 출력함수 
		// System.out.println();
		// 주의 : 리터널 자체로 출력은 비효율적이다. 변수 지정해서 출력해라.
		
		// 변수지정
		// 자료형 변수 순서
		// int i = 10;
		// i : 정수만 저장하는 변수
		
		int i = 10;
		System.out.println(i);
		
		// i = 10.5 사용불가(int 때문)
		// 정수의 기본 크기 : 4byte
		// -2147483648 ~ 2147483647
		
		// 실수 기본 크기 : 8byte

	}

}
